<template>
  <div class="about-me-container">
    <div class="about-me-box">
      <h1>Почему я захотела стать программистом</h1>
      <p>
        С самого детства я знала, что определённо хочу быть связаной с программированием. Мой папа работал программистом и я с самого
        детства видела, чем занимаются люди этой профессии. Видела и минусы, и плюсы. Я не смотрела на всё через розовые очки, понимала,
        что это кропотливый труд, связанный с постоянным самообразованием, решением головоломок, часто бессоных ночей. Но мне всё это 
        очень нравилось. В школе я попала в кружок робототехники и тогда окончательно влюбилась в программирование. Я неоднократно 
        ездила на олимпиады в городе, писала исследовательсую работу по физике с применением программирования (на тот момент всего лишь PascalABC).
        А поступив в вуз, я только укрепилась в желании связать себя с IT. Мне очень нравится разгадывать сложные задачки, искать пути для их решения.
        кроме того я получаю невероятное удовольствие от процесса работы, поиска ошибок, разработки наиболее оптимального решения. Конкрентно
        Frontend-разработка меня привлекает тем, что это очень творческое направление, к тому же ты можешь сразу видеть результат свой работы.
      </p>
    </div>
  </div>
</template>

<script>
export default {
  name: 'AboutMe',
};
</script>

<style scoped>
.about-me-container {
  display: flex;
  justify-content: center;
  margin-top: 30px;
}

.about-me-box {
  background-color: #ffffff;
  box-shadow: 0 8px 10px rgba(0, 0, 0, 0.3);
  padding: 20px;
  width: 60%;
  text-align: center;
  border-radius: 8px;
}

.about-me-box h1 {
  font-size: 24px;
}

.about-me-box p {
  font-size: 18px;
  margin-top: 10px;
}
</style>
